import Card from '../Card/Card';
import './Cards.scss'

const Cards = () => {

    let productCards = [
        {
            id: 1,
            title: "Оплата",
            descr: 'Можливі будь-які види оплати. Безготівковий розрахунок для юридичних та фізичних осіб.'
        },
        {
            id: 2,
            title: "Доставка",
            descr: 'Вартість доставки залежить від родовища каменю та відповідає чинним тарифам на вантажоперевезення авто та залізничного транспорту. Уточнюйте у менеджерів.'
        },
        {
            id: 3,
            title: "Гарантія якості",
            descr: 'Вся гарантійна продукція відповідає ДСТУ 32018-2012,23342-2012,9480-2012. Це характеризує наш граніт як продукцію найвищої якості.'
        }
    ]


    return (
        <>
            <div className="product__cards">
                {<Card/> && productCards.map((item, index) => (<Card key={index} info={item} />))}
            </div>
        </>
    )
}


export default Cards;
